In [2]:
import pandas as pd

In [4]:
df=pd.read_csv('D:\AI-datasource\data14.titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [8]:
inputs=df.drop('Survived',axis='columns')
target=df.Survived

In [10]:
#inputs.Sex=inputs.Sex map({'male':1,'female':0})

In [11]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [16]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [17]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [19]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [20]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [23]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(8)

   Pclass        Age     Fare  female
0       3  22.000000   7.2500       0
1       1  38.000000  71.2833       1
2       3  26.000000   7.9250       1
3       1  35.000000  53.1000       1
4       3  35.000000   8.0500       0
5       3  29.699118   8.4583       0
6       1  54.000000  51.8625       0
7       3   2.000000  21.0750       0

In [41]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test =train_test_split(inputs,target,test_size=0.3)

In [42]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [43]:
model.fit(X_train,y_train)

GaussianNB()

In [44]:
model.score(X_test,y_test)

0.7425373134328358

In [45]:
X_test[0:10]

     Pclass        Age     Fare  female
43        2   3.000000  41.5792       1
830       3  15.000000  14.4542       1
62        1  45.000000  83.4750       0
144       2  18.000000  11.5000       0
673       2  31.000000  13.0000       0
768       3  29.699118  24.1500       0
315       3  26.000000   7.8542       1
75        3  25.000000   7.6500       0
521       3  22.000000   7.8958       0
543       2  32.000000  26.0000       0

In [46]:
y_test[0:10]

43     1
830    1
62     0
144    0
673    1
768    0
315    1
75     0
521    0
543    1
Name: Survived, dtype: int64

In [47]:
model.predict(X_test[0:10])

array([1, 1, 1, 0, 0, 0, 1, 0, 0, 0], dtype=int64)

In [48]:
model.predict_proba(X_test[0:10])

array([[0.13606369, 0.86393631],
       [0.41070243, 0.58929757],
       [0.3698031 , 0.6301969 ],
       [0.93772942, 0.06227058],
       [0.944765  , 0.055235  ],
       [0.97557869, 0.02442131],
       [0.44336776, 0.55663224],
       [0.97501815, 0.02498185],
       [0.97426395, 0.02573605],
       [0.94259603, 0.05740397]])

In [52]:
#Calculate the score using cross validation

In [51]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=5)

array([0.8       , 0.808     , 0.792     , 0.80645161, 0.75      ])